package com.company;
import java.util.Scanner;
public class Main {

    public static void main(String[] args) {
        //Козловский Константин
	// Integer15. Дано трехзначное число.
        // Вывести число, полученное при перестановке цифр сотен и десятков исходного числа (например, 123 перейдет в213).
        /*Scanner in = new Scanner(System.in);
        int a= in.nextInt();
        System.out.println("Введите трёхзначное число :");
            int res= a/100*10+ (a%100)/10*100+a%10 ;
        System.out.println("Число, полученное при перестановке цифр: "+res);
          */
        // Integer15. Дано трехзначное число.
        // Вывести число, полученное при перестановке цифр десятков и единиц исходного числа (например, 123 перейдетв 132).
         /*Scanner in = new Scanner(System.in);
        System.out.println("Введите трёхзначное число :");
        int a =in.nextInt();
        int res = a/100*100+ (a%100)/10+a%10*10;
        System.out.println("Число, полученное при перестановке цифр: "+res);
          */
    }
}
