package com.company;

public class Main {

    public static void main(String[] args) {
        // Дана сторона квадрата a. Найти его периметр P = 4·a.
        //Ввод или присвоение исходных данных
       /* int a = 8;
        //Вычисление результата
        int P = 4 * a;
        //Выводим на экран результат
        System.out.println(P);
        */
        //Дана сторона квадрата a. Найти его площадь S = a^2
         /*int a=  5;
        int S= a*a ;
        //Выводим на экран результат
        System.out.println(" у квадрата со стороной "+ a +" площадь S );
          */
        // Дан диаметр окружности d. Найти ее длину L = π·d. В качестве
        //значения π использовать 3.14.
         /*int d = 10;
        final double pi=  3.14;
        double L = pi * d;
        System.out.println(" у круга с диаметром "+ d +" длина окружности " + L );
            */
        // Дана длина ребра куба a. Найти объем куба V = a^3
        //и площадь его поверхности S= 6*a^2
  /* int a= 3;
    int V= a*a*a;
    int S= 6*a*a;
        System.out.println(" Площадь поверхности куба:"+S);
                System.out.println("Обьем куба:"+V)';
   */
//Даны длины ребер a, b, c прямоугольного параллелепипеда. Найти
//его объем V = a·b·c и площадь поверхности S = 2·(a·b + b·c + a·c).  }
       /* int a = 2;
        int b = 4;
        int c = 6;
        int V = a * b * c;
        int S = 2 * (a * b + b * c + a * c);
        System.out.println(" Обьем: " + V);
        System.out.println(" площадь поверхности: " + S);
                */
       //Даны два числа a и b. Найти их среднее арифметическое: (a + b)/2.
        int a = 4;
        int b= 6;
        double z= (a+b)/(double) 2;
        System.out.println(" Среднее арифметическое " + z);
    }
    }